import numpy as np
from model import sql_connect
from control import song_management as sm
from control import playlist_management as pm

color_names = ['하양',
 '아이보리',
 '노랑',
 '금색',
 '분홍',
 '주황색',
 '골든옐로우',
 '코랄',
 '다홍',
 '장미',
 '카민',
 '빨강',
 '살구',
 '베이지',
 '귤색',
 '유황',
 '오페라',
 '세리스',
 '크림슨',
 '탠',
 '카키',
 '은색',
 '라임',
 '민트',
 '회적',
 '황토',
 '연두',
 '버건디',
 '하늘',
 '자주',
 '회색',
 '갈색',
 '보라',
 '올리브',
 '스페이스그레이',
 '울트라마린',
 '청록',
 '춘록',
 '초록',
 '바다',
 '코발트블루',
 '파랑',
 '남색',
 '검정']
color_explain = ['이 감정은 순수, 깨끗, 정제 등을 나타낼 수 있습니다. 만약 하양 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 기분을 정확히 이해하고 표현하는 것도 좋을 것 같습니다.',
 '이 감정은 안녕, 평화, 조용함 등을 나타낼 수 있습니다. 만약 아이보리 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 조용한 공간에서 잠깐 쉬거나, 자신이 좋아하는 일을 하며 마음을 다잡는 것도 좋을 것 같습니다.',
 '이 감정은 행복, 기쁨, 활기 등을 나타낼 수 있습니다. 만약 노랑 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 자존심, 영광, 자부심 등을 나타낼 수 있습니다. 만약 금색 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 사랑, 즐거움, 기쁨 등을 나타낼 수 있습니다. 만약 분홍 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 활기, 열정, 새로움 등을 나타낼 수 있습니다. 만약 주황색 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 성장, 성공, 달성 등을 나타낼 수 있습니다. 만약 골든옐로우 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 정적, 조용함, 순리 등을 나타낼 수 있습니다. 만약 코랄 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 조용한 공간에서 잠깐 쉬거나, 자신이 좋아하는 일을 하며 마음을 다잡는 것도 좋을 것 같습니다.',
 '이 감정은 사랑, 즐거움, 기쁨 등을 나타낼 수 있습니다. 만약 다홍 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 사랑, 즐거움, 기쁨 등을 나타낼 수 있습니다. 만약 장미 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 기쁨, 행복, 안녕 등을 나타낼 수 있습니다. 만약 카민 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 분노, 화남, 긴장 등을 나타낼 수 있습니다. 만약 빨강 감정을 느끼고 계시다면, 이를 적극적으로 표현하는 것이 좋을 것 같습니다. 자신의 감정을 제대로 이해하고, 적극적으로 표현하는 것이 좋을 것 같습니다.',
 '이 감정은 따뜻함, 친근함, 온화함 등을 나타낼 수 있습니다. 만약 살구 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 안정, 진리, 자신감 등을 나타낼 수 있습니다. 만약 베이지 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 평온, 긴장 해소, 만족 등을 나타낼 수 있습니다. 만약 귤색 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 절망, 슬픔, 좌절 등을 나타낼 수 있습니다. 만약 유황 감정을 느끼고 계시다면, 이를 적극적으로 표현하는 것이 좋을 것 같습니다. 자신의 감정을 제대로 이해하고, 적극적으로 표현하는 것이 좋을 것 같습니다.',
 '이 감정은 기쁨, 사랑, 감동 등을 나타낼 수 있습니다. 만약 오페라 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 욕망, 지배적인 성격, 자기 중심적인 성향 등을 나타낼 수 있습니다. 만약 세리스 감정을 느끼고 계시다면, 이를 적극적으로 표현하는 것이 좋을 것 같습니다. 자신의 감정을 제대로 이해하고, 적극적으로 표현하는 것이 좋을 것 같습니다.',
 '이 감정은 안정, 신뢰, 온화 등을 나타낼 수 있습니다. 만약 크림슨 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 외향적인 성향, 자신감 등을 나타낼 수 있습니다. 만약 탠 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 은유적인 성향, 내면적인 성향 등을 나타낼 수 있습니다. 만약 카키 감정을 느끼고 계시다면, 이를 적극적으로 표현하는 것이 좋을 것 같습니다. 자신의 감정을 제대로 이해하고, 적극적으로 표현하는 것이 좋을 것 같습니다.',
 '이 감정은 천진난만, 민감함, 차분함 등을 나타낼 수 있습니다. 만약 은색 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 상쾌함, 열정, 이상을 나타낼 수 있습니다. 만약 라임 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 신중함, 정중함, 차분함 등을 나타낼 수 있습니다. 만약 민트 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 슬픔, 절망, 외로움 등을 나타낼 수 있습니다. 만약 회적 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 지적인 성향, 철학적인 성향 등을 나타낼 수 있습니다. 만약 황토 감정을 느끼고 계시다면, 이를 적극적으로 표현하는 것이 좋을 것 같습니다. 자신의 감정을 제대로 이해하고, 적극적으로 표현하는 것이 좋을 것 같습니다.',
 '이 감정은 생동감, 이상, 즐거움 등을 나타낼 수 있습니다. 만약 연두 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 사랑, 정의, 신념 등을 나타낼 수 있습니다. 만약 버건디 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 태평, 존재, 영광 등을 나타낼 수 있습니다. 만약 하늘 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 기쁨, 사랑, 소소한 행복 등을 나타낼 수 있습니다. 만약 자주 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 중립, 균형, 무관심 등을 나타낼 수 있습니다. 만약 회색 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 안정, 지향적, 소소한 행복 등을 나타낼 수 있습니다. 만약 갈색 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 집중, 균형, 존재 등을 나타낼 수 있습니다. 만약 보라 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 순수, 고독, 고요 등을 나타낼 수 있습니다. 만약 올리브 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 차분, 안정, 공간 등을 나타낼 수 있습니다. 만약 스페이스그레이 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 섹시, 자신감, 그리고 애정 등을 나타낼 수 있습니다. 만약 울트라마린 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 활력, 새로움, 이동 등을 나타낼 수 있습니다. 만약 청록 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 새로운 시작, 상쾌함, 우아함 등을 나타낼 수 있습니다. 만약 춘록 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 활력, 생명, 진정 등을 나타낼 수 있습니다. 만약 초록 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 평화, 넓이, 자유 등을 나타낼 수 있습니다. 만약 바다 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 안정, 차분, 깊이 등을 나타낼 수 있습니다. 만약 코발트블루 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 신뢰, 진정, 차분 등을 나타낼 수 있습니다. 만약 파랑 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 존중, 안정, 진정 등을 나타낼 수 있습니다. 만약 남색 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.',
 '이 감정은 신비, 역동, 위대함 등을 나타낼 수 있습니다. 만약 검정 감정을 느끼고 계시다면, 이를 긍정적으로 받아들이고 이를 유지하는 것이 좋을 것 같습니다. 즐거운 일을 하며 마음을 열어두는 것도 좋을 것 같습니다.']



color_rgb = [[255, 255, 255],
 [255, 255, 240],
 [255, 255, 0],
 [255, 215, 0],
 [255, 192, 203],
 [255, 165, 0],
 [255, 140, 0],
 [255, 127, 80],
 [255, 36, 0],
 [255, 0, 127],
 [255, 0, 64],
 [255, 0, 0],
 [253, 188, 180],
 [245, 245, 220],
 [245, 151, 0],
 [241, 221, 56],
 [236, 17, 143],
 [222, 49, 99],
 [220, 20, 60],
 [210, 180, 140],
 [189, 183, 107],
 [192, 192, 192],
 [191, 255, 0],
 [189, 252, 201],
 [206, 170, 173],
 [184, 134, 11],
 [154, 205, 50],
 [144, 0, 32],
 [135, 206, 235],
 [128, 0, 128],
 [128, 128, 128],
 [165, 42, 42],
 [127, 0, 255],
 [128, 128, 0],
 [103, 103, 103],
 [35, 71, 148],
 [13, 152, 186],
 [0, 255, 127],
 [0, 128, 0],
 [0, 127, 255],
 [0, 71, 171],
 [0, 0, 255],
 [0, 0, 128],
 [0, 0, 0]]

color_info = {
    'happy' : [253, 251, 84],
    'fear' : [3,149,6],
    'angry' : [179,6,7],
    'dislike' : [224,89,232],
    'surprise' : [91,190,255],
    'sad' : [82,83,225]
}

music_color = {
    'happy' : [253, 251, 84],
    'sad' : [82,83,225],
    'angry' : [179,6,7],
    'relaxed' : [82,252,81]
}

rgb_dict = {0:[0,75,142], 1:[251,171,76], 2:[203,233,243], 3:[198,230,121], 4:[255,78,109], 5:[208,28,31]}

def make_color(lyric, melody):
    multiple = np.array([max(melody[0], melody[3]), melody[1], melody[2]])
        
    
    c_r, c_g, c_b = 0, 0 ,0
    for i in range(6):
        c_r += list(color_info.values())[i][0] * lyric[i]
        c_g += list(color_info.values())[i][1] * lyric[i]
        c_b += list(color_info.values())[i][2] * lyric[i]
    
    result = np.array([c_r, c_g, c_b]) * np.add(multiple, 1)
    result = np.array([255 if x >= 255 else x for x in result.reshape(-1)]).reshape(-1,3)
    ans = np.argmin(np.power(np.array(result) - np.array(color_rgb), 2).sum(axis=1))
    return color_names[ans], result, color_explain[ans]


def find_nearest_song(lyric, sound, counts=1):
    mysql_db = sql_connect.conn_mysqldb()
    db_cursor = mysql_db.cursor()
    sql = '''select * from song_info_sound'''
    db_cursor.execute(sql)
    all_sound = db_cursor.fetchall()
    
    mysql_db = sql_connect.conn_mysqldb()
    db_cursor = mysql_db.cursor()
    sql = '''select * from song_info_lyrics'''
    db_cursor.execute(sql)
    all_lyrics = db_cursor.fetchall()
    
    concat = np.concatenate((np.array(all_lyrics)[:,2:].astype(np.float), np.array(all_sound)[:,2:].astype(np.float)), axis=1)
    concat_input = list(lyric) + list(sound)
    
    nearest = np.argsort(np.sum(np.power(concat - np.array(concat_input), 2), axis=1))[:5*counts]
    rand_mask = np.random.choice([i for i in range(counts*5)], counts, replace=False)
    pick = nearest[rand_mask]
    
    result_song_id = []
    for el in pick:
        result_song_id.append(all_sound[el][0])
    
    return result_song_id
    
def find_song_from_test(rgb, counts=1):
    test_rgb = rgb
    
    mysql_db = sql_connect.conn_mysqldb()
    db_cursor = mysql_db.cursor()
    sql = '''select * from song_info_sound'''
    db_cursor.execute(sql)
    all_sound = db_cursor.fetchall()
    
    mysql_db = sql_connect.conn_mysqldb()
    db_cursor = mysql_db.cursor()
    sql = '''select * from song_info_lyrics'''
    db_cursor.execute(sql)
    all_lyrics = db_cursor.fetchall()
    
    
    rgbs = []
    for i in range(len(all_sound)):
        rgbs.append(make_color(lyric=list(all_lyrics[i])[2:], melody=list(all_sound[i])[2:])[1][0])
    nearest = np.argsort(np.sum(np.power(np.array(rgbs) - np.array(test_rgb), 2), axis=1))[:5*counts]
    rand_mask = np.random.choice([i for i in range(counts*5)], counts, replace=False)
    pick = nearest[rand_mask]
    
    result_song_id = []
    for el in pick:
        result_song_id.append(all_sound[el][0])
    
    return result_song_id

if __name__ == '__main__':
    print(color_explain)

# 화창한 날에
# 멀어진 이유
# 다시 사랑 할 수 있을까
# 헤어지는 중입니다
# 눈 떠보니 이별이더라

# Honesyt
# As I am
# Wonder
# Wraith
# Can you Feel the Love Tonight

# 기다리는 시간
# 갈바람
# 너에게 간다
# 가을의 전설
# I Can't Never Stop

# 상남자의 고백
# 누군가의 마음이 되면
# 웃음꽃
# 시계 바늘
# Falling

# Lonely
# Gangsta Gangsta
# Nothing But Trouble
# Stand Up And Shout
# Testify

# Single Ladies
# World of the Forgotten
# Who's Got You Singing Again
# Unshaken
# Elephant
